'use strict';

var NAMES = ["安倍 晴明","アガサ クリスティ","アメリゴ ヴェスプッチ","在原 業平","アルベルト アインシュタイン","和泉 式部","ウィリアム シェイクスピア","小野 小町","小野 妹子","柿本 人麻呂","鴨 長明","鑑真","紀 貫之","行尊","空海","クリストファー コロンブス","クレオパトラ","ココ シャネル","坂上 田村麻呂","サルヴァトーレ フェラガモ","猿丸大夫","ジャンヌ ダルク","ジョン 万次郎","親鸞","蝉丸","蘇我 入鹿","平 清盛","平 将門","トーマス エジソン","中大兄皇子","卑弥呼","藤原 朝忠","藤原 鎌足","藤原 定方","藤原 頼経","フランシスコ ザビエル","ヘレン ケラー","北条 時政","北条 政子","法然","マリー アントワネット","源 義経","源 頼家","源 頼朝","紫式部","ヨハン ゼバスティアン バッハ","ルートヴィヒ ヴァン ベートーヴェン","レオナルド ダ ビンチ","伊達 政宗","伊東 一刀斎","伊東 巳代治","伊藤 博文","井伊 直政","井伊 直弼","井上 馨","井上 毅","一休 宗純","榎本 武揚","夏目 漱石","歌川 広重","葛飾 北斎","岩崎 弥太郎","岩倉 具視","喜多川 歌麿","吉田 兼好","宮本 武蔵","桐野 利秋","芹沢 鴨","近衛 篤麿","近藤 勇","金子 堅太郎","桂 太郎","源 実朝","源 頼家","源 頼朝","後醍醐 天皇","後藤 象二郎","孝明天皇","幸徳 秋水","江藤 新平","高杉 晋作","黒田 清隆","佐々木 小次郎","最上 義守","細川 忠興","三好 長慶","三条 実美","山岡 鉄舟","山本 権兵衛","山縣 有朋","寺島 宗則","渋沢 栄一","勝 海舟","小林 一茶","松永 貞徳","松尾 芭蕉","松方 正義","上杉 謙信","織田 信長","新島 八重","新島 襄","森 鴎外","森 有礼","正岡 子規","清少納言","聖徳太子","西園寺 公望","西郷 従道","西郷 隆盛","西太后","青木 周蔵","石田 三成","千 利休","川路 利良","足利 義満","足利 尊氏","村田 新八","大塩 平八郎","大久保 利通","大隈 重信","大山 巌","大木 喬任","中江 兆民","長宗我部 元親","津田 梅子","土方 歳三","島津 久光","東郷 平八郎","藤原 定家","徳川 家慶","徳川 家継","徳川 家光","徳川 家康","徳川 家綱","徳川 家治","徳川 家重","徳川 家斉","徳川 家宣","徳川 家定","徳川 家茂","徳川 吉宗","徳川 慶喜","徳川 光圀","徳川 綱吉","徳川 秀忠","内村 鑑三","板垣 退助","樋口 一葉","品川 弥二郎","武田 信玄","伏見 天皇","福澤 諭吉","平賀 源内","別府 晋介","宝蔵院 胤栄","北条 政子","明治 天皇","明智 光秀","毛利 元就","木戸 孝允","柳生 宗厳","与謝 蕪村","与謝野 晶子","楊貴妃","アントニオ ヴィヴァルディ","カミーユ サン=サーンス","セルゲイ ラフマニノフ","ジョージ ワシントン","ジョン アダムズ","トーマス ジェファーソン","ジェームズ マディスン","ジェームズ モンロー","ジョン クィンシー アダムズ","アンドリュー ジャクソン","セオドア ルーズベルト","フランクリン ルーズベルト","ドワイト D アイゼンハワー","ジョン F ケネディ","ヨハネス ブラームス","グスタフ マーラー","モーリス ラヴェル","ピョートル チャイコフスキー","マルティン ルター","ジャン=ジャック ルソー","クロード モネ","坂本 龍馬","浅井 長政","吉田 松陰","朝倉 義景","新渡戸 稲造","二宮 金次郎","弁慶","アンドリュー カーネギー","ヘンリー フォード","二葉亭四迷","イエス キリスト","十返舎一九","ヨハネス グーテンベルグ","アルフレッド ノーベル","湯川秀樹","ジークムント フロイト","マシュー ペリー"];

$(function(){
  // Timeline post
  $("._5x46").each(function(){
    var index = Math.floor(Math.random() * NAMES.length);
    var imgURL = chrome.extension.getURL("img/" + index + ".png");
    $(this).find("img").attr("src", imgURL);
    $(this).find('a[href*="fref=nf"]').each(function(){
      if ($(this).text() != "") {
        $(this).text(NAMES[index]);
      }
    });
  });

  // Comment
  $(".UFIComment").each(function(){
      var index = Math.floor(Math.random() * NAMES.length);
      var imgURL = chrome.extension.getURL("img/" + index + ".png");
      $(this).find("img").attr("src", imgURL);
      $(this).find('.UFICommentActorName').text(NAMES[index]);
  });
});
